app/controllers/main_controller.rb

SELECT "task_lists".* FROM "task_lists" ORDER BY "task_lists"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "task_lists".* FROM "task_lists"
SELECT "tasks".* FROM "tasks"
---
    def home
        @tasklists = TaskList.all.to_a
        @num_tasklists = @tasklists.length
        @tasks = Task.all
        @num_tasks = @tasks.length

SELECT "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def list
        @id = params[:tlid].to_i
        @tasklist = TaskList.find_by(id:@id)